In [64]:
people = {
    "first":["ahsan", "jane","john"],
    "last":["javed","Doe", "Doe"],
    "email":["ahsan@email.com", "jane@email.com", "john@email.com"]
}

import pandas as pd
df = pd.DataFrame(people)

In [2]:
df

   first   last            email
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com
2   john    Doe   john@email.com

## Add a coluumn by adding two colmn

In [65]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first   last            email    full_name
0  ahsan  javed  ahsan@email.com  ahsan javed
1   jane    Doe   jane@email.com     jane Doe
2   john    Doe   john@email.com     john Doe

## Drop a column

In [11]:
df.drop(columns=['first' , 'last'], inplace=True)
df

             email    full_name
0  ahsan@email.com  ahsan javed
1   jane@email.com     jane Doe
2   john@email.com     john Doe

## split full name column and add two column of first and last name from it

In [14]:
df['full_name'].str.split(' ')
df['full_name'].str.split(' ', expand=True)  #expand is used to assign tese lists in two different columns

       0      1
0  ahsan  javed
1   jane    Doe
2   john    Doe

In [24]:
df[['first','last']] = df['full_name'].str.split(' ', expand=True)
df

             email    full_name   name   last  first
0  ahsan@email.com  ahsan javed  ahsan  javed  ahsan
1   jane@email.com     jane Doe   jane    Doe   jane
2   john@email.com     john Doe   john    Doe   john

## Add a row

In [36]:
df = pd.concat([df , pd.DataFrame([{'name':'yousaf'}])], ignore_index = True) #so firsat has to make a dataframe
df

             email    full_name    name   last  first
0  ahsan@email.com  ahsan javed   ahsan  javed  ahsan
1   jane@email.com     jane Doe    jane    Doe   jane
2   john@email.com     john Doe    john    Doe   john
3              NaN          NaN  yousaf    NaN    NaN
4              NaN          NaN  yousaf    NaN    NaN

In [60]:
people = {
    "first":["ahsan", "jane","john"],
    "last":["javed","Doe", "Doe"],
    "email":["ahsan@email.com", "jane@email.com", "john@email.com"]
}

import pandas as pd
df = pd.DataFrame(people)

people1 = {
    "first":["ahsan", "jane","john"],
    "last":["javed","Doe", "Doe"],
    "email":["ahsan@email.com", "jane@email.com", "john@email.com"]
}

import pandas as pd
df1 = pd.DataFrame(people)

In [61]:
finaldf = pd.concat([df, df1])

In [43]:
finaldf

   first   last            email
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com
2   john    Doe   john@email.com
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com
2   john    Doe   john@email.com

In [47]:
finaldf = pd.concat([df, df1], ignore_index=True, sort = False)
finaldf

   first   last            email
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com
2   john    Doe   john@email.com
3  ahsan  javed  ahsan@email.com
4   jane    Doe   jane@email.com
5   john    Doe   john@email.com

## drop a full row

In [51]:
finaldf.drop(index=4, inplace=True)
finaldf

   first   last            email
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com
2   john    Doe   john@email.com
3  ahsan  javed  ahsan@email.com
5   john    Doe   john@email.com

## drop a row of specif name.For this we use filter.supppose of john

In [63]:
filt = df['first'] == 'john'
finaldf.drop(index = df[filt].index, inplace=True)
finaldf

   first   last            email
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com
0  ahsan  javed  ahsan@email.com
1   jane    Doe   jane@email.com